Revit 2027 API
Space.Volume Property
Get the Volume of the Space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Volume { get; }
Public ReadOnly Property Volume As Double
	Get
public:
property double Volume {
	double get ();
}
member Volume : float with get
Property Value
Double
Remarks
This property is used to get the Volume of the Space.
See Also
Reference
Space Class
Autodesk.Revit.DB.Mechanical Namespace